
# State **`s3://infrahouse-github-control-state/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |    Change |    Destroy |
|:---------:|--------:|----------:|-----------:|
|     ✅     |       3 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                                           |
|:--------:|:------------------------------------------------------------------------------------|
|    🟢     | `module.repos["terraform-aws-update-dns"].github_actions_secret.secret["GH_TOKEN"]` |
|    🟢     | `module.repos["terraform-aws-update-dns"].github_repository.repo`                   |
|    🟢     | `module.repos["terraform-aws-update-dns"].github_team_repository.dev`               |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.repos["terraform-aws-update-dns"].github_actions_secret.secret["GH_TOKEN"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "terraform-aws-update-dns"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # module.repos["terraform-aws-update-dns"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Module creates a lambda that manages DNS A records for instances in an autoscaling group."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "terraform-aws-update-dns"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
    }

  # module.repos["terraform-aws-update-dns"].github_team_repository.dev will be created
  + resource "github_team_repository" "dev" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "terraform-aws-update-dns"
      + team_id    = "7332815"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: module.infrahouse8-github-control.module.state-bucket.random_pet.suffix: Refreshing state... [id=infrahouse-github-control-state-polished-lioness]%0Adata.external.env: Reading...%0Adata.external.env: Read complete after 0s [id=-]%0Amodule.ih_8_repos["github-control"].github_repository.repo: Refreshing state... [id=github-control]%0Amodule.ih8_tf_template.github_repository.repo: Refreshing state... [id=terraform-template]%0Agithub_membership.infrahouse["akuzminsky"]: Refreshing state... [id=infrahouse:akuzminsky]%0Agithub_team.dev: Refreshing state... [id=7332815]%0Agithub_organization_settings.infrahouse: Refreshing state... [id=121984263]%0Amodule.ih_tf_template.github_repository.repo: Refreshing state... [id=terraform-template]%0Agithub_team_members.dev: Refreshing state... [id=7332815]%0Amodule.ih_8_repos["github-control"].github_branch_default.main: Refreshing state... [id=github-control]%0Amodule.ih_8_repos["github-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=github-control:GH_TOKEN]%0Amodule.ih_8_repos["github-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=github-control:akuzminsky]%0Amodule.ih_8_repos["github-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOI2vu7M4CAici]%0Amodule.ih_tf_template.github_team_repository.dev[0]: Refreshing state... [id=7332815:terraform-template]%0Amodule.infrahouse8-github-control.module.state-bucket.aws_dynamodb_table.terraform_locks: Refreshing state... [id=infrahouse-github-control-state-polished-lioness]%0Adata.aws_ssm_parameter.gh_secrets_namespace: Reading...%0Adata.aws_secretsmanager_secrets.gh_secrets: Reading...%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_openid_connect_provider.github: Reading...%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy.admin: Reading...%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.github-trust: Reading...%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.github-trust: Read complete after 0s [id=2229426295]%0Amodule.infrahouse8-github-control.module.gha-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-github-control-github]%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.admin-trust: Reading...%0Agithub_actions_variable.role_github: Refreshing state... [id=github-control:role_github]%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.assume: Reading...%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.admin-trust: Read complete after 0s [id=91398067]%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=262017685]%0Amodule.infrahouse8-github-control.module.gha-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-github-control-admin]%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-github-control-state-manager]%0Adata.aws_secretsmanager_secrets.gh_secrets: Read complete after 0s [id=us-west-1]%0Agithub_actions_variable.role_admin: Refreshing state... [id=github-control:role_admin]%0Agithub_actions_variable.role_state_manager: Refreshing state... [id=github-control:role_state_manager]%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.github-permissions: Reading...%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=2246898652]%0Amodule.infrahouse8-github-control.module.gha-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::303467602807:policy/ih-tf-github-control-github20231016152934873800000001]%0Adata.aws_ssm_parameter.gh_secrets_namespace: Read complete after 0s [id=gh_secrets_namespace]%0Aaws_secretsmanager_secret.pypi_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__PYPI_API_TOKEN-5N8UtG]%0Aaws_secretsmanager_secret.codacy_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__CODACY_PROJECT_TOKEN-fhlOS2]%0Amodule.infrahouse8-github-control.module.gha-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-github-control-github-20231016152935026000000003]%0Agithub_actions_variable.dynamodb_lock_table_name: Refreshing state... [id=github-control:dynamodb_lock_table_name]%0Amodule.infrahouse8-github-control.module.state-bucket.aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-github-control-state]%0Adata.aws_secretsmanager_secret_version.pypi_api_token: Reading...%0Adata.aws_secretsmanager_secret_version.codacy_api_token: Reading...%0Adata.aws_secretsmanager_secret_version.pypi_api_token: Read complete after 1s [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__PYPI_API_TOKEN-5N8UtG|AWSCURRENT]%0Adata.aws_secretsmanager_secret_version.codacy_api_token: Read complete after 1s [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__CODACY_PROJECT_TOKEN-fhlOS2|AWSCURRENT]%0Amodule.repos["infrahouse-website-infra"].github_repository.repo: Refreshing state... [id=infrahouse-website-infra]%0Amodule.repos["cookiecutter-github-control"].github_repository.repo: Refreshing state... [id=cookiecutter-github-control]%0Amodule.repos["terraform-aws-debian-repo"].github_repository.repo: Refreshing state... [id=terraform-aws-debian-repo]%0Amodule.repos["terraform-aws-github-role"].github_repository.repo: Refreshing state... [id=terraform-aws-github-role]%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy.admin: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.repos["terraform-aws-elasticsearch"].github_repository.repo: Refreshing state... [id=terraform-aws-elasticsearch]%0Amodule.repos["terraform-aws-cloud-init"].github_repository.repo: Refreshing state... [id=terraform-aws-cloud-init]%0Amodule.repos["terraform-aws-gh-identity-provider"].github_repository.repo: Refreshing state... [id=terraform-aws-gh-identity-provider]%0Amodule.repos["infrahouse-puppet-data"].github_repository.repo: Refreshing state... [id=infrahouse-puppet-data]%0Amodule.repos["aws-control"].github_repository.repo: Refreshing state... [id=aws-control]%0Amodule.repos["terraform-aws-ci-cd"].github_repository.repo: Refreshing state... [id=terraform-aws-ci-cd]%0Amodule.repos["terraform-aws-jumphost"].github_repository.repo: Refreshing state... [id=terraform-aws-jumphost]%0Amodule.repos["terraform-aws-service-network"].github_repository.repo: Refreshing state... [id=terraform-aws-service-network]%0Amodule.repos["aws-control-303467602807"].github_repository.repo: Refreshing state... [id=aws-control-303467602807]%0Amodule.repos["terraform-aws-state-manager"].github_repository.repo: Refreshing state... [id=terraform-aws-state-manager]%0Amodule.repos["proxysql-sandbox"].github_repository.repo: Refreshing state... [id=proxysql-sandbox]%0Amodule.repos["puppet-code"].github_repository.repo: Refreshing state... [id=puppet-code]%0Amodule.repos["terraform-aws-website-pod"].github_repository.repo: Refreshing state... [id=terraform-aws-website-pod]%0Amodule.repos["terraform-aws-state-bucket"].github_repository.repo: Refreshing state... [id=terraform-aws-state-bucket]%0Amodule.repos["terraform-aws-ecs"].github_repository.repo: Refreshing state... [id=terraform-aws-ecs]%0Amodule.repos["aws-control-493370826424"].github_repository.repo: Refreshing state... [id=aws-control-493370826424]%0Amodule.repos["infrahouse-com"].github_repository.repo: Refreshing state... [id=infrahouse-com]%0Amodule.repos["aws-control-289256138624"].github_repository.repo: Refreshing state... [id=aws-control-289256138624]%0Amodule.repos["terraform-aws-gha-admin"].github_repository.repo: Refreshing state... [id=terraform-aws-gha-admin]%0Amodule.repos["infrahouse-toolkit"].github_repository.repo: Refreshing state... [id=infrahouse-toolkit]%0Amodule.repos["terraform-aws-instance-profile"].github_repository.repo: Refreshing state... [id=terraform-aws-instance-profile]%0Amodule.infrahouse8-github-control.module.gha-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-github-control-admin-20231016152934892800000002]%0Amodule.infrahouse8-github-control.module.state-bucket.aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-github-control-state]%0Amodule.infrahouse8-github-control.module.state-bucket.aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-github-control-state]%0Amodule.infrahouse8-github-control.module.state-bucket.aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-github-control-state]%0Agithub_actions_variable.state_bucket: Refreshing state... [id=github-control:state_bucket]%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.permissions_ro: Reading...%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=3098380055]%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.permissions_rw: Reading...%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=19153250]%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_policy.permissions_ro: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-github-control-state-manager-ro20231016152936860000000001]%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_policy.permissions_rw: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-github-control-state-manager-rw20231016152936864600000002]%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_role_policy_attachment.state-manager-rw[0]: Refreshing state... [id=ih-tf-github-control-state-manager-20231016152937028600000004]%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_role_policy_attachment.state-manager-ro: Refreshing state... [id=ih-tf-github-control-state-manager-20231016152936987100000003]%0Amodule.repos["terraform-aws-ci-cd"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-ci-cd]%0Amodule.repos["terraform-aws-elasticsearch"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-elasticsearch]%0Amodule.repos["aws-control-303467602807"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-303467602807]%0Amodule.repos["terraform-aws-debian-repo"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-debian-repo]%0Amodule.repos["infrahouse-website-infra"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-website-infra]%0Amodule.repos["infrahouse-puppet-data"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-puppet-data]%0Amodule.repos["infrahouse-toolkit"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-toolkit]%0Amodule.repos["infrahouse-com"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-com]%0Amodule.repos["terraform-aws-jumphost"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-jumphost]%0Amodule.repos["proxysql-sandbox"].github_team_repository.dev: Refreshing state... [id=7332815:proxysql-sandbox]%0Amodule.repos["terraform-aws-ecs"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-ecs]%0Amodule.repos["cookiecutter-github-control"].github_team_repository.dev: Refreshing state... [id=7332815:cookiecutter-github-control]%0Amodule.repos["aws-control-493370826424"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-493370826424]%0Amodule.repos["terraform-aws-cloud-init"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-cloud-init]%0Amodule.repos["terraform-aws-gh-identity-provider"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-gh-identity-provider]%0Amodule.repos["terraform-aws-instance-profile"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-instance-profile]%0Amodule.repos["puppet-code"].github_team_repository.dev: Refreshing state... [id=7332815:puppet-code]%0Amodule.repos["terraform-aws-website-pod"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-website-pod]%0Amodule.repos["terraform-aws-gha-admin"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-gha-admin]%0Amodule.repos["terraform-aws-state-bucket"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-state-bucket]%0Amodule.repos["aws-control"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control]%0Amodule.repos["terraform-aws-service-network"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-service-network]%0Amodule.repos["terraform-aws-state-manager"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-state-manager]%0Amodule.repos["terraform-aws-github-role"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-github-role]%0Amodule.repos["aws-control-289256138624"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-289256138624]%0Amodule.repos["terraform-aws-state-manager"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-state-manager:GH_TOKEN]%0Amodule.repos["aws-control-493370826424"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-493370826424:AWS_DEFAULT_REGION]%0Amodule.repos["infrahouse-toolkit"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-toolkit:AWS_DEFAULT_REGION]%0Amodule.repos["terraform-aws-state-bucket"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-state-bucket:GH_TOKEN]%0Amodule.repos["terraform-aws-gha-admin"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-gha-admin:GH_TOKEN]%0Amodule.repos["terraform-aws-cloud-init"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-cloud-init:GH_TOKEN]%0Amodule.repos["terraform-aws-service-network"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-service-network:GH_TOKEN]%0Amodule.repos["infrahouse-website-infra"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-website-infra:AWS_DEFAULT_REGION]%0Amodule.repos["terraform-aws-github-role"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-github-role:GH_TOKEN]%0Amodule.repos["aws-control-493370826424"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-493370826424:GH_TOKEN]%0Amodule.repos["infrahouse-toolkit"].github_actions_secret.secret["PYPI_API_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:PYPI_API_TOKEN]%0Amodule.repos["terraform-aws-elasticsearch"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-elasticsearch:GH_TOKEN]%0Amodule.repos["cookiecutter-github-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=cookiecutter-github-control:GH_TOKEN]%0Amodule.repos["infrahouse-toolkit"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:GH_TOKEN]%0Amodule.repos["aws-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control:GH_TOKEN]%0Amodule.repos["infrahouse-toolkit"].github_actions_secret.secret["CODACY_PROJECT_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:CODACY_PROJECT_TOKEN]%0Amodule.repos["puppet-code"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=puppet-code:AWS_DEFAULT_REGION]%0Amodule.repos["terraform-aws-gh-identity-provider"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-gh-identity-provider:GH_TOKEN]%0Amodule.repos["terraform-aws-instance-profile"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-instance-profile:GH_TOKEN]%0Amodule.repos["terraform-aws-jumphost"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-jumphost:GH_TOKEN]%0Amodule.repos["terraform-aws-ecs"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-ecs:GH_TOKEN]%0Amodule.repos["terraform-aws-website-pod"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-website-pod:GH_TOKEN]%0Amodule.repos["infrahouse-puppet-data"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-puppet-data:GH_TOKEN]%0Amodule.repos["infrahouse-com"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-com:GH_TOKEN]%0Amodule.repos["terraform-aws-debian-repo"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-debian-repo:GH_TOKEN]%0Amodule.repos["aws-control-303467602807"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-303467602807:AWS_DEFAULT_REGION]%0Amodule.repos["aws-control-289256138624"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-289256138624:AWS_DEFAULT_REGION]%0Amodule.repos["aws-control-289256138624"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-289256138624:GH_TOKEN]%0Amodule.repos["infrahouse-com"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-com:AWS_DEFAULT_REGION]%0Amodule.repos["puppet-code"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=puppet-code:GH_TOKEN]%0Amodule.repos["infrahouse-website-infra"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-website-infra:GH_TOKEN]%0Amodule.repos["aws-control-303467602807"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-303467602807:GH_TOKEN]%0Amodule.repos["infrahouse-puppet-data"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-puppet-data:AWS_DEFAULT_REGION]%0Amodule.repos["terraform-aws-ci-cd"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-ci-cd:GH_TOKEN]%0Amodule.repos["proxysql-sandbox"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=proxysql-sandbox:GH_TOKEN]%0Amodule.repos["aws-control"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control:AWS_DEFAULT_REGION]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.repos["terraform-aws-update-dns"].github_actions_secret.secret["GH_TOKEN"] will be created%0A  + resource "github_actions_secret" "secret" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "terraform-aws-update-dns"%0A      + secret_name     = "GH_TOKEN"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # module.repos["terraform-aws-update-dns"].github_repository.repo will be created%0A  + resource "github_repository" "repo" {%0A      + allow_auto_merge            = false%0A      + allow_merge_commit          = true%0A      + allow_rebase_merge          = true%0A      + allow_squash_merge          = true%0A      + archived                    = false%0A      + default_branch              = (known after apply)%0A      + delete_branch_on_merge      = false%0A      + description                 = "Module creates a lambda that manages DNS A records for instances in an autoscaling group."%0A      + etag                        = (known after apply)%0A      + full_name                   = (known after apply)%0A      + git_clone_url               = (known after apply)%0A      + has_issues                  = true%0A      + html_url                    = (known after apply)%0A      + http_clone_url              = (known after apply)%0A      + id                          = (known after apply)%0A      + merge_commit_message        = "PR_TITLE"%0A      + merge_commit_title          = "MERGE_MESSAGE"%0A      + name                        = "terraform-aws-update-dns"%0A      + node_id                     = (known after apply)%0A      + primary_language            = (known after apply)%0A      + private                     = (known after apply)%0A      + repo_id                     = (known after apply)%0A      + squash_merge_commit_message = "COMMIT_MESSAGES"%0A      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"%0A      + ssh_clone_url               = (known after apply)%0A      + svn_url                     = (known after apply)%0A      + topics                      = (known after apply)%0A      + visibility                  = "public"%0A    }%0A%0A  # module.repos["terraform-aws-update-dns"].github_team_repository.dev will be created%0A  + resource "github_team_repository" "dev" {%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + permission = "push"%0A      + repository = "terraform-aws-update-dns"%0A      + team_id    = "7332815"%0A    }%0A%0APlan: 3 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtZ2l0aHViLWNvbnRyb2wtc3RhdGUvdGVycmFmb3JtLnRmc3RhdGUiOiB7InN1Y2Nlc3MiOiB0cnVlLCAic3Rkb3V0IjogIlRlcnJhZm9ybSB1c2VkIHRoZSBzZWxlY3RlZCBwcm92aWRlcnMgdG8gZ2VuZXJhdGUgdGhlIGZvbGxvd2luZyBleGVjdXRpb25cbnBsYW4uIFJlc291cmNlIGFjdGlvbnMgYXJlIGluZGljYXRlZCB3aXRoIHRoZSBmb2xsb3dpbmcgc3ltYm9sczpcbiAgKyBjcmVhdGVcblxuVGVycmFmb3JtIHdpbGwgcGVyZm9ybSB0aGUgZm9sbG93aW5nIGFjdGlvbnM6XG5cbiAgIyBtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXVwZGF0ZS1kbnNcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiZ2l0aHViX2FjdGlvbnNfc2VjcmV0XCIgXCJzZWNyZXRcIiB7XG4gICAgICArIGNyZWF0ZWRfYXQgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwbGFpbnRleHRfdmFsdWUgPSAoc2Vuc2l0aXZlIHZhbHVlKVxuICAgICAgKyByZXBvc2l0b3J5ICAgICAgPSBcInRlcnJhZm9ybS1hd3MtdXBkYXRlLWRuc1wiXG4gICAgICArIHNlY3JldF9uYW1lICAgICA9IFwiR0hfVE9LRU5cIlxuICAgICAgKyB1cGRhdGVkX2F0ICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgfVxuXG4gICMgbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy11cGRhdGUtZG5zXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG8gd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJnaXRodWJfcmVwb3NpdG9yeVwiIFwicmVwb1wiIHtcbiAgICAgICsgYWxsb3dfYXV0b19tZXJnZSAgICAgICAgICAgID0gZmFsc2VcbiAgICAgICsgYWxsb3dfbWVyZ2VfY29tbWl0ICAgICAgICAgID0gdHJ1ZVxuICAgICAgKyBhbGxvd19yZWJhc2VfbWVyZ2UgICAgICAgICAgPSB0cnVlXG4gICAgICArIGFsbG93X3NxdWFzaF9tZXJnZSAgICAgICAgICA9IHRydWVcbiAgICAgICsgYXJjaGl2ZWQgICAgICAgICAgICAgICAgICAgID0gZmFsc2VcbiAgICAgICsgZGVmYXVsdF9icmFuY2ggICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBkZWxldGVfYnJhbmNoX29uX21lcmdlICAgICAgPSBmYWxzZVxuICAgICAgKyBkZXNjcmlwdGlvbiAgICAgICAgICAgICAgICAgPSBcIk1vZHVsZSBjcmVhdGVzIGEgbGFtYmRhIHRoYXQgbWFuYWdlcyBETlMgQSByZWNvcmRzIGZvciBpbnN0YW5jZXMgaW4gYW4gYXV0b3NjYWxpbmcgZ3JvdXAuXCJcbiAgICAgICsgZXRhZyAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBmdWxsX25hbWUgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGdpdF9jbG9uZV91cmwgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaGFzX2lzc3VlcyAgICAgICAgICAgICAgICAgID0gdHJ1ZVxuICAgICAgKyBodG1sX3VybCAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGh0dHBfY2xvbmVfdXJsICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBtZXJnZV9jb21taXRfbWVzc2FnZSAgICAgICAgPSBcIlBSX1RJVExFXCJcbiAgICAgICsgbWVyZ2VfY29tbWl0X3RpdGxlICAgICAgICAgID0gXCJNRVJHRV9NRVNTQUdFXCJcbiAgICAgICsgbmFtZSAgICAgICAgICAgICAgICAgICAgICAgID0gXCJ0ZXJyYWZvcm0tYXdzLXVwZGF0ZS1kbnNcIlxuICAgICAgKyBub2RlX2lkICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHByaW1hcnlfbGFuZ3VhZ2UgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcHJpdmF0ZSAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyByZXBvX2lkICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHNxdWFzaF9tZXJnZV9jb21taXRfbWVzc2FnZSA9IFwiQ09NTUlUX01FU1NBR0VTXCJcbiAgICAgICsgc3F1YXNoX21lcmdlX2NvbW1pdF90aXRsZSAgID0gXCJDT01NSVRfT1JfUFJfVElUTEVcIlxuICAgICAgKyBzc2hfY2xvbmVfdXJsICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHN2bl91cmwgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdG9waWNzICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB2aXNpYmlsaXR5ICAgICAgICAgICAgICAgICAgPSBcInB1YmxpY1wiXG4gICAgfVxuXG4gICMgbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy11cGRhdGUtZG5zXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2IHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiZ2l0aHViX3RlYW1fcmVwb3NpdG9yeVwiIFwiZGV2XCIge1xuICAgICAgKyBldGFnICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwZXJtaXNzaW9uID0gXCJwdXNoXCJcbiAgICAgICsgcmVwb3NpdG9yeSA9IFwidGVycmFmb3JtLWF3cy11cGRhdGUtZG5zXCJcbiAgICAgICsgdGVhbV9pZCAgICA9IFwiNzMzMjgxNVwiXG4gICAgfVxuXG5QbGFuOiAzIHRvIGFkZCwgMCB0byBjaGFuZ2UsIDAgdG8gZGVzdHJveS5cblxuXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXG5cblNhdmVkIHRoZSBwbGFuIHRvOiB0Zi5wbGFuXG5cblRvIHBlcmZvcm0gZXhhY3RseSB0aGVzZSBhY3Rpb25zLCBydW4gdGhlIGZvbGxvd2luZyBjb21tYW5kIHRvIGFwcGx5OlxuICAgIHRlcnJhZm9ybSBhcHBseSBcInRmLnBsYW5cIlxuOjpkZWJ1Zzo6VGVycmFmb3JtIGV4aXRlZCB3aXRoIGNvZGUgMC5cbjo6ZGVidWc6OnN0ZG91dDogbW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5zdGF0ZS1idWNrZXQucmFuZG9tX3BldC5zdWZmaXg6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtZ2l0aHViLWNvbnRyb2wtc3RhdGUtcG9saXNoZWQtbGlvbmVzc10lMEFkYXRhLmV4dGVybmFsLmVudjogUmVhZGluZy4uLiUwQWRhdGEuZXh0ZXJuYWwuZW52OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0tXSUwQW1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2xdJTBBbW9kdWxlLmloOF90Zl90ZW1wbGF0ZS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tdGVtcGxhdGVdJTBBZ2l0aHViX21lbWJlcnNoaXAuaW5mcmFob3VzZVtcImFrdXptaW5za3lcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2U6YWt1em1pbnNreV0lMEFnaXRodWJfdGVhbS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTVdJTBBZ2l0aHViX29yZ2FuaXphdGlvbl9zZXR0aW5ncy5pbmZyYWhvdXNlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD0xMjE5ODQyNjNdJTBBbW9kdWxlLmloX3RmX3RlbXBsYXRlLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS10ZW1wbGF0ZV0lMEFnaXRodWJfdGVhbV9tZW1iZXJzLmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNV0lMEFtb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfZGVmYXVsdC5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbF0lMEFtb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2w6R0hfVE9LRU5dJTBBbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeV9jb2xsYWJvcmF0b3IuY29sbGFib3JhdG9yc1tcImFrdXptaW5za3lcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1jb250cm9sOmFrdXptaW5za3ldJTBBbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfYnJhbmNoX3Byb3RlY3Rpb24ubWFpbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9QlBSX2t3RE9JMnZ1N000Q0FpY2ldJTBBbW9kdWxlLmloX3RmX3RlbXBsYXRlLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2WzBdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnRlcnJhZm9ybS10ZW1wbGF0ZV0lMEFtb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLnN0YXRlLWJ1Y2tldC5hd3NfZHluYW1vZGJfdGFibGUudGVycmFmb3JtX2xvY2tzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWdpdGh1Yi1jb250cm9sLXN0YXRlLXBvbGlzaGVkLWxpb25lc3NdJTBBZGF0YS5hd3Nfc3NtX3BhcmFtZXRlci5naF9zZWNyZXRzX25hbWVzcGFjZTogUmVhZGluZy4uLiUwQWRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldHMuZ2hfc2VjcmV0czogUmVhZGluZy4uLiUwQW1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLmRhdGEuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLmdoYS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4uZGF0YS5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXSUwQW1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXRydXN0OiBSZWFkaW5nLi4uJTBBbW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItdHJ1c3Q6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTIyMjk0MjYyOTVdJTBBbW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4uYXdzX2lhbV9yb2xlLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtZ2l0aHViLWNvbnRyb2wtZ2l0aHViXSUwQW1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWRtaW4tdHJ1c3Q6IFJlYWRpbmcuLi4lMEFnaXRodWJfYWN0aW9uc192YXJpYWJsZS5yb2xlX2dpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2w6cm9sZV9naXRodWJdJTBBbW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4ubW9kdWxlLnN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLmdoYS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLXRydXN0OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD05MTM5ODA2N10lMEFtb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLmdoYS1hZG1pbi5tb2R1bGUuc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjYyMDE3Njg1XSUwQW1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLmF3c19pYW1fcm9sZS5hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtZ2l0aHViLWNvbnRyb2wtYWRtaW5dJTBBbW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4ubW9kdWxlLnN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlLnN0YXRlLW1hbmFnZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWdpdGh1Yi1jb250cm9sLXN0YXRlLW1hbmFnZXJdJTBBZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0cy5naF9zZWNyZXRzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD11cy13ZXN0LTFdJTBBZ2l0aHViX2FjdGlvbnNfdmFyaWFibGUucm9sZV9hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2w6cm9sZV9hZG1pbl0lMEFnaXRodWJfYWN0aW9uc192YXJpYWJsZS5yb2xlX3N0YXRlX21hbmFnZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1jb250cm9sOnJvbGVfc3RhdGVfbWFuYWdlcl0lMEFtb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLmdoYS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQW1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMjQ2ODk4NjUyXSUwQW1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLmF3c19pYW1fcG9saWN5LmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvaWgtdGYtZ2l0aHViLWNvbnRyb2wtZ2l0aHViMjAyMzEwMTYxNTI5MzQ4NzM4MDAwMDAwMDFdJTBBZGF0YS5hd3Nfc3NtX3BhcmFtZXRlci5naF9zZWNyZXRzX25hbWVzcGFjZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9Z2hfc2VjcmV0c19uYW1lc3BhY2VdJTBBYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5weXBpX2FwaV90b2tlbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6MzAzNDY3NjAyODA3OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX1BZUElfQVBJX1RPS0VOLTVOOFV0R10lMEFhd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LmNvZGFjeV9hcGlfdG9rZW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjMwMzQ2NzYwMjgwNzpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX19DT0RBQ1lfUFJPSkVDVF9UT0tFTi1maGxPUzJdJTBBbW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4uYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtZ2l0aHViLWNvbnRyb2wtZ2l0aHViLTIwMjMxMDE2MTUyOTM1MDI2MDAwMDAwMDAzXSUwQWdpdGh1Yl9hY3Rpb25zX3ZhcmlhYmxlLmR5bmFtb2RiX2xvY2tfdGFibGVfbmFtZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2w6ZHluYW1vZGJfbG9ja190YWJsZV9uYW1lXSUwQW1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuc3RhdGUtYnVja2V0LmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWdpdGh1Yi1jb250cm9sLXN0YXRlXSUwQWRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLnB5cGlfYXBpX3Rva2VuOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24uY29kYWN5X2FwaV90b2tlbjogUmVhZGluZy4uLiUwQWRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLnB5cGlfYXBpX3Rva2VuOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTozMDM0Njc2MDI4MDc6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fUFlQSV9BUElfVE9LRU4tNU44VXRHfEFXU0NVUlJFTlRdJTBBZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24uY29kYWN5X2FwaV90b2tlbjogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6MzAzNDY3NjAyODA3OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX0NPREFDWV9QUk9KRUNUX1RPS0VOLWZobE9TMnxBV1NDVVJSRU5UXSUwQW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFdJTBBbW9kdWxlLnJlcG9zW1wiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWNvb2tpZWN1dHRlci1naXRodWItY29udHJvbF0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWRlYmlhbi1yZXBvXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtZGViaWFuLXJlcG9dJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1naXRodWItcm9sZVwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWdpdGh1Yi1yb2xlXSUwQW1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW46IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1lbGFzdGljc2VhcmNoXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtZWxhc3RpY3NlYXJjaF0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWNsb3VkLWluaXRcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1jbG91ZC1pbml0XSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtZ2gtaWRlbnRpdHktcHJvdmlkZXJcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1naC1pZGVudGl0eS1wcm92aWRlcl0lMEFtb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXB1cHBldC1kYXRhXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcHVwcGV0LWRhdGFdJTBBbW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2xdJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1jaS1jZFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWNpLWNkXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtanVtcGhvc3RcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1qdW1waG9zdF0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXNlcnZpY2UtbmV0d29ya1wiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLXNlcnZpY2UtbmV0d29ya10lMEFtb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3Mtc3RhdGUtbWFuYWdlclwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLXN0YXRlLW1hbmFnZXJdJTBBbW9kdWxlLnJlcG9zW1wicHJveHlzcWwtc2FuZGJveFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1wcm94eXNxbC1zYW5kYm94XSUwQW1vZHVsZS5yZXBvc1tcInB1cHBldC1jb2RlXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXB1cHBldC1jb2RlXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3Mtd2Vic2l0ZS1wb2RcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy13ZWJzaXRlLXBvZF0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXN0YXRlLWJ1Y2tldFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLXN0YXRlLWJ1Y2tldF0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWVjc1wiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWVjc10lMEFtb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XSUwQW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtY29tXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtY29tXSUwQW1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRdJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1naGEtYWRtaW5cIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1naGEtYWRtaW5dJTBBbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtdG9vbGtpdF0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWluc3RhbmNlLXByb2ZpbGVcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1pbnN0YW5jZS1wcm9maWxlXSUwQW1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtZ2l0aHViLWNvbnRyb2wtYWRtaW4tMjAyMzEwMTYxNTI5MzQ4OTI4MDAwMDAwMDJdJTBBbW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5zdGF0ZS1idWNrZXQuYXdzX3MzX2J1Y2tldF92ZXJzaW9uaW5nLmVuYWJsZWQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtZ2l0aHViLWNvbnRyb2wtc3RhdGVdJTBBbW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5zdGF0ZS1idWNrZXQuYXdzX3MzX2J1Y2tldF9wdWJsaWNfYWNjZXNzX2Jsb2NrLnB1YmxpY19hY2Nlc3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtZ2l0aHViLWNvbnRyb2wtc3RhdGVdJTBBbW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5zdGF0ZS1idWNrZXQuYXdzX3MzX2J1Y2tldF9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2NvbmZpZ3VyYXRpb24uZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1naXRodWItY29udHJvbC1zdGF0ZV0lMEFnaXRodWJfYWN0aW9uc192YXJpYWJsZS5zdGF0ZV9idWNrZXQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1jb250cm9sOnN0YXRlX2J1Y2tldF0lMEFtb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLmdoYS1hZG1pbi5tb2R1bGUuc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3JvOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4ubW9kdWxlLnN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ybzogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzA5ODM4MDA1NV0lMEFtb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLmdoYS1hZG1pbi5tb2R1bGUuc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3J3OiBSZWFkaW5nLi4uJTBBbW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4ubW9kdWxlLnN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ydzogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTkxNTMyNTBdJTBBbW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4ubW9kdWxlLnN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnNfcm86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWdpdGh1Yi1jb250cm9sLXN0YXRlLW1hbmFnZXItcm8yMDIzMTAxNjE1MjkzNjg2MDAwMDAwMDAwMV0lMEFtb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLmdoYS1hZG1pbi5tb2R1bGUuc3RhdGUtbWFuYWdlci5hd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9uc19ydzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpwb2xpY3kvaWgtdGYtZ2l0aHViLWNvbnRyb2wtc3RhdGUtbWFuYWdlci1ydzIwMjMxMDE2MTUyOTM2ODY0NjAwMDAwMDAyXSUwQW1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLm1vZHVsZS5zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyLXJ3WzBdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1naXRodWItY29udHJvbC1zdGF0ZS1tYW5hZ2VyLTIwMjMxMDE2MTUyOTM3MDI4NjAwMDAwMDA0XSUwQW1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLm1vZHVsZS5zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyLXJvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1naXRodWItY29udHJvbC1zdGF0ZS1tYW5hZ2VyLTIwMjMxMDE2MTUyOTM2OTg3MTAwMDAwMDAzXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtY2ktY2RcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLWF3cy1jaS1jZF0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWVsYXN0aWNzZWFyY2hcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLWF3cy1lbGFzdGljc2VhcmNoXSUwQW1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTphd3MtY29udHJvbC0zMDM0Njc2MDI4MDddJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1kZWJpYW4tcmVwb1wiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tYXdzLWRlYmlhbi1yZXBvXSUwQW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTppbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFdJTBBbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS1wdXBwZXQtZGF0YVwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTppbmZyYWhvdXNlLXB1cHBldC1kYXRhXSUwQW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTppbmZyYWhvdXNlLXRvb2xraXRdJTBBbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS1jb21cIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6aW5mcmFob3VzZS1jb21dJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1qdW1waG9zdFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tYXdzLWp1bXBob3N0XSUwQW1vZHVsZS5yZXBvc1tcInByb3h5c3FsLXNhbmRib3hcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6cHJveHlzcWwtc2FuZGJveF0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWVjc1wiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tYXdzLWVjc10lMEFtb2R1bGUucmVwb3NbXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6Y29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXSUwQW1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTphd3MtY29udHJvbC00OTMzNzA4MjY0MjRdJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1jbG91ZC1pbml0XCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnRlcnJhZm9ybS1hd3MtY2xvdWQtaW5pdF0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWdoLWlkZW50aXR5LXByb3ZpZGVyXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnRlcnJhZm9ybS1hd3MtZ2gtaWRlbnRpdHktcHJvdmlkZXJdJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1pbnN0YW5jZS1wcm9maWxlXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnRlcnJhZm9ybS1hd3MtaW5zdGFuY2UtcHJvZmlsZV0lMEFtb2R1bGUucmVwb3NbXCJwdXBwZXQtY29kZVwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTpwdXBwZXQtY29kZV0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXdlYnNpdGUtcG9kXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnRlcnJhZm9ybS1hd3Mtd2Vic2l0ZS1wb2RdJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1naGEtYWRtaW5cIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLWF3cy1naGEtYWRtaW5dJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1zdGF0ZS1idWNrZXRcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLWF3cy1zdGF0ZS1idWNrZXRdJTBBbW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2xcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6YXdzLWNvbnRyb2xdJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1zZXJ2aWNlLW5ldHdvcmtcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLWF3cy1zZXJ2aWNlLW5ldHdvcmtdJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1zdGF0ZS1tYW5hZ2VyXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnRlcnJhZm9ybS1hd3Mtc3RhdGUtbWFuYWdlcl0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWdpdGh1Yi1yb2xlXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnRlcnJhZm9ybS1hd3MtZ2l0aHViLXJvbGVdJTBBbW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmF3cy1jb250cm9sLTI4OTI1NjEzODYyNF0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXN0YXRlLW1hbmFnZXJcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLXN0YXRlLW1hbmFnZXI6R0hfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNDpBV1NfREVGQVVMVF9SRUdJT05dJTBBbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtdG9vbGtpdDpBV1NfREVGQVVMVF9SRUdJT05dJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1zdGF0ZS1idWNrZXRcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLXN0YXRlLWJ1Y2tldDpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWdoYS1hZG1pblwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtZ2hhLWFkbWluOkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtY2xvdWQtaW5pdFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtY2xvdWQtaW5pdDpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXNlcnZpY2UtbmV0d29ya1wiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3Mtc2VydmljZS1uZXR3b3JrOkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0RFRkFVTFRfUkVHSU9OXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmE6QVdTX0RFRkFVTFRfUkVHSU9OXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtZ2l0aHViLXJvbGVcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWdpdGh1Yi1yb2xlOkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNDpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXRvb2xraXRcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIlBZUElfQVBJX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXRvb2xraXQ6UFlQSV9BUElfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1lbGFzdGljc2VhcmNoXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1lbGFzdGljc2VhcmNoOkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWNvb2tpZWN1dHRlci1naXRodWItY29udHJvbDpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXRvb2xraXRcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXRvb2xraXQ6R0hfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbDpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXRvb2xraXRcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkNPREFDWV9QUk9KRUNUX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXRvb2xraXQ6Q09EQUNZX1BST0pFQ1RfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1wicHVwcGV0LWNvZGVcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19ERUZBVUxUX1JFR0lPTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cHVwcGV0LWNvZGU6QVdTX0RFRkFVTFRfUkVHSU9OXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtZ2gtaWRlbnRpdHktcHJvdmlkZXJcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWdoLWlkZW50aXR5LXByb3ZpZGVyOkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtaW5zdGFuY2UtcHJvZmlsZVwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtaW5zdGFuY2UtcHJvZmlsZTpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWp1bXBob3N0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1qdW1waG9zdDpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWVjc1wiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtZWNzOkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3Mtd2Vic2l0ZS1wb2RcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLXdlYnNpdGUtcG9kOkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtcHVwcGV0LWRhdGFcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXB1cHBldC1kYXRhOkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtY29tXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1jb206R0hfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1kZWJpYW4tcmVwb1wiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtZGViaWFuLXJlcG86R0hfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNzpBV1NfREVGQVVMVF9SRUdJT05dJTBBbW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sLTI4OTI1NjEzODYyNDpBV1NfREVGQVVMVF9SRUdJT05dJTBBbW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0OkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtY29tXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtY29tOkFXU19ERUZBVUxUX1JFR0lPTl0lMEFtb2R1bGUucmVwb3NbXCJwdXBwZXQtY29kZVwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXB1cHBldC1jb2RlOkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYTpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDc6R0hfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS1wdXBwZXQtZGF0YVwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0RFRkFVTFRfUkVHSU9OXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXB1cHBldC1kYXRhOkFXU19ERUZBVUxUX1JFR0lPTl0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWNpLWNkXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1jaS1jZDpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJwcm94eXNxbC1zYW5kYm94XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cHJveHlzcWwtc2FuZGJveDpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0RFRkFVTFRfUkVHSU9OXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbDpBV1NfREVGQVVMVF9SRUdJT05dJTBBJTBBVGVycmFmb3JtIHVzZWQgdGhlIHNlbGVjdGVkIHByb3ZpZGVycyB0byBnZW5lcmF0ZSB0aGUgZm9sbG93aW5nIGV4ZWN1dGlvbiUwQXBsYW4uIFJlc291cmNlIGFjdGlvbnMgYXJlIGluZGljYXRlZCB3aXRoIHRoZSBmb2xsb3dpbmcgc3ltYm9sczolMEEgICsgY3JlYXRlJTBBJTBBVGVycmFmb3JtIHdpbGwgcGVyZm9ybSB0aGUgZm9sbG93aW5nIGFjdGlvbnM6JTBBJTBBICAjIG1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtdXBkYXRlLWRuc1wiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl0gd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiZ2l0aHViX2FjdGlvbnNfc2VjcmV0XCIgXCJzZWNyZXRcIiB7JTBBICAgICAgKyBjcmVhdGVkX2F0ICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwbGFpbnRleHRfdmFsdWUgPSAoc2Vuc2l0aXZlIHZhbHVlKSUwQSAgICAgICsgcmVwb3NpdG9yeSAgICAgID0gXCJ0ZXJyYWZvcm0tYXdzLXVwZGF0ZS1kbnNcIiUwQSAgICAgICsgc2VjcmV0X25hbWUgICAgID0gXCJHSF9UT0tFTlwiJTBBICAgICAgKyB1cGRhdGVkX2F0ICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy11cGRhdGUtZG5zXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG8gd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiZ2l0aHViX3JlcG9zaXRvcnlcIiBcInJlcG9cIiB7JTBBICAgICAgKyBhbGxvd19hdXRvX21lcmdlICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgICsgYWxsb3dfbWVyZ2VfY29tbWl0ICAgICAgICAgID0gdHJ1ZSUwQSAgICAgICsgYWxsb3dfcmViYXNlX21lcmdlICAgICAgICAgID0gdHJ1ZSUwQSAgICAgICsgYWxsb3dfc3F1YXNoX21lcmdlICAgICAgICAgID0gdHJ1ZSUwQSAgICAgICsgYXJjaGl2ZWQgICAgICAgICAgICAgICAgICAgID0gZmFsc2UlMEEgICAgICArIGRlZmF1bHRfYnJhbmNoICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGRlbGV0ZV9icmFuY2hfb25fbWVyZ2UgICAgICA9IGZhbHNlJTBBICAgICAgKyBkZXNjcmlwdGlvbiAgICAgICAgICAgICAgICAgPSBcIk1vZHVsZSBjcmVhdGVzIGEgbGFtYmRhIHRoYXQgbWFuYWdlcyBETlMgQSByZWNvcmRzIGZvciBpbnN0YW5jZXMgaW4gYW4gYXV0b3NjYWxpbmcgZ3JvdXAuXCIlMEEgICAgICArIGV0YWcgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGZ1bGxfbmFtZSAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGdpdF9jbG9uZV91cmwgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGhhc19pc3N1ZXMgICAgICAgICAgICAgICAgICA9IHRydWUlMEEgICAgICArIGh0bWxfdXJsICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGh0dHBfY2xvbmVfdXJsICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG1lcmdlX2NvbW1pdF9tZXNzYWdlICAgICAgICA9IFwiUFJfVElUTEVcIiUwQSAgICAgICsgbWVyZ2VfY29tbWl0X3RpdGxlICAgICAgICAgID0gXCJNRVJHRV9NRVNTQUdFXCIlMEEgICAgICArIG5hbWUgICAgICAgICAgICAgICAgICAgICAgICA9IFwidGVycmFmb3JtLWF3cy11cGRhdGUtZG5zXCIlMEEgICAgICArIG5vZGVfaWQgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHByaW1hcnlfbGFuZ3VhZ2UgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHByaXZhdGUgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHJlcG9faWQgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHNxdWFzaF9tZXJnZV9jb21taXRfbWVzc2FnZSA9IFwiQ09NTUlUX01FU1NBR0VTXCIlMEEgICAgICArIHNxdWFzaF9tZXJnZV9jb21taXRfdGl0bGUgICA9IFwiQ09NTUlUX09SX1BSX1RJVExFXCIlMEEgICAgICArIHNzaF9jbG9uZV91cmwgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHN2bl91cmwgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHRvcGljcyAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHZpc2liaWxpdHkgICAgICAgICAgICAgICAgICA9IFwicHVibGljXCIlMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXVwZGF0ZS1kbnNcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXYgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiZ2l0aHViX3RlYW1fcmVwb3NpdG9yeVwiIFwiZGV2XCIgeyUwQSAgICAgICsgZXRhZyAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwZXJtaXNzaW9uID0gXCJwdXNoXCIlMEEgICAgICArIHJlcG9zaXRvcnkgPSBcInRlcnJhZm9ybS1hd3MtdXBkYXRlLWRuc1wiJTBBICAgICAgKyB0ZWFtX2lkICAgID0gXCI3MzMyODE1XCIlMEEgICAgfSUwQSUwQVBsYW46IDMgdG8gYWRkLCAwIHRvIGNoYW5nZSwgMCB0byBkZXN0cm95LiUwQSUwQVx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMCUwQSUwQVNhdmVkIHRoZSBwbGFuIHRvOiB0Zi5wbGFuJTBBJTBBVG8gcGVyZm9ybSBleGFjdGx5IHRoZXNlIGFjdGlvbnMsIHJ1biB0aGUgZm9sbG93aW5nIGNvbW1hbmQgdG8gYXBwbHk6JTBBICAgIHRlcnJhZm9ybSBhcHBseSBcInRmLnBsYW5cIiUwQVxuOjpkZWJ1Zzo6c3RkZXJyOiBcbjo6ZGVidWc6OmV4aXRjb2RlOiAwIiwgInN0ZGVyciI6ICIiLCAiYWRkIjogMywgImNoYW5nZSI6IDAsICJkZXN0cm95IjogMH19```
</p></details>